p744581755/kw38_uart/framework/SerialManager/source/UART_Serial_Adapter.c
/*! *********************************************************************************
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2017, 2019 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */
#include "UART_Serial_Adapter.h"


#if (defined(FSL_FEATURE_SOC_UART_COUNT)&&(FSL_FEATURE_SOC_UART_COUNT > 0))
#include "fsl_uart.h"
#endif

#if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0))
#include "fsl_lpuart.h"
#endif

#if (defined(FSL_FEATURE_SOC_LPSCI_COUNT)&&(FSL_FEATURE_SOC_LPSCI_COUNT > 0))
#include "fsl_lpsci.h"
#endif

#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
#include "fsl_usart.h"
#endif

/*! *********************************************************************************
*************************************************************************************
* Private memory declarations
*************************************************************************************
********************************************************************************** */
#if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0))
static LPUART_Type * mLpuartBase[] = LPUART_BASE_PTRS;
static uartState_t * pLpuartStates[FSL_FEATURE_SOC_LPUART_COUNT];
static void LPUART_Common_ISR(uint32_t instance);
#endif

#if (defined(FSL_FEATURE_SOC_UART_COUNT)&&(FSL_FEATURE_SOC_UART_COUNT > 0))
static UART_Type * mUartBase[] = UART_BASE_PTRS;
static uartState_t * pUartStates[FSL_FEATURE_SOC_UART_COUNT];
static void UART_Common_ISR(uint32_t instance);
#endif

#if (defined(FSL_FEATURE_SOC_LPSCI_COUNT)&&(FSL_FEATURE_SOC_LPSCI_COUNT > 0))
static UART0_Type * mLpsciBase[] = UART0_BASE_PTRS;
static uartState_t * pLpsciStates[FSL_FEATURE_SOC_LPSCI_COUNT];
static void LPSCI_Common_ISR(uint32_t instance);
#endif

#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
static USART_Type  *mUsartBase[]    = USART_BASE_PTRS;
static IRQn_Type    mUsartIrqs[]    = USART_IRQS;
static uartState_t *pUsartStates[FSL_FEATURE_SOC_USART_COUNT];
static void USART_ISR(void);
#endif


/*******************************************************************************
 * Variables
 ******************************************************************************/
lpuart_edma_handle_t g_lpuartEdmaHandle;
edma_handle_t g_lpuartTxEdmaHandle;
edma_handle_t g_lpuartRxEdmaHandle;
AT_NONCACHEABLE_SECTION_INIT(uint8_t g_tipString[]) =
    "LPUART EDMA example\r\nSend back received data\r\nEcho every 8 characters\r\n";
AT_NONCACHEABLE_SECTION_INIT(uint8_t g_txBuffer[ECHO_BUFFER_LENGTH]) = {0};
AT_NONCACHEABLE_SECTION_INIT(uint8_t g_rxBuffer[ECHO_BUFFER_LENGTH]) = {0};
volatile bool rxBufferEmpty                                          = true;
volatile bool txBufferFull                                           = false;
volatile bool txOnGoing                                              = false;
volatile bool rxOnGoing                                              = false;

/*! *********************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
********************************************************************************** */

/************************************************************************************/
/*                                     LPUART                                       */
/************************************************************************************/
#if defined(gSerialCyclesToWaitAfterInitialize) && ( gSerialCyclesToWaitAfterInitialize != 0)
static uint32_t LPUART_ClearRxByte(uint32_t instance)
{
    LPUART_Type * base;
    uint32_t status;

    base   = mLpuartBase[instance];
    status = LPUART_GetStatusFlags(base);

    SERIAL_DBG_LOG("[%x] sts=%x", instance, status);

#if 0
    while ( ((uint32_t)(kLPUART_RxDataRegFullFlag) & status ) == 0)
    {
       status = LPUART_GetStatusFlags(base);
    }
#endif

    /* Check if data was received */
    if( (bool)((uint32_t)(kLPUART_RxDataRegFullFlag) & status ) )
    {
        uint8_t data = LPUART_ReadByte(base);
        status = LPUART_GetStatusFlags(base);
        SERIAL_DBG_LOG("data=%x, sts=%x", data, status);
    }

    return status;
}
#endif
void test_case()
{
	lpuart_transfer_t xfer;
	lpuart_transfer_t sendXfer;
	lpuart_transfer_t receiveXfer;
	
	/* Send g_tipString out. */
	xfer.data	  = g_tipString;
	xfer.dataSize = sizeof(g_tipString) - 1;
	txOnGoing	  = true;
	LPUART_SendEDMA(DEMO_LPUART, &g_lpuartEdmaHandle, &xfer);
	
	/* Wait send finished */
	while (txOnGoing)
	{
	}
	
	/* Start to echo. */
	sendXfer.data		 = g_txBuffer;
	sendXfer.dataSize	 = ECHO_BUFFER_LENGTH;
	receiveXfer.data	 = g_rxBuffer;
	receiveXfer.dataSize = ECHO_BUFFER_LENGTH;
	
	while (1)
	{
		/* If RX is idle and g_rxBuffer is empty, start to read data to g_rxBuffer. */
		if ((!rxOnGoing) && rxBufferEmpty)
		{
			rxOnGoing = true;
			LPUART_ReceiveEDMA(DEMO_LPUART, &g_lpuartEdmaHandle, &receiveXfer);
		}
	
		/* If TX is idle and g_txBuffer is full, start to send data. */
		if ((!txOnGoing) && txBufferFull)
		{
			txOnGoing = true;
			LPUART_SendEDMA(DEMO_LPUART, &g_lpuartEdmaHandle, &sendXfer);
		}
	
		/* If g_txBuffer is empty and g_rxBuffer is full, copy g_rxBuffer to g_txBuffer. */
		if ((!rxBufferEmpty) && (!txBufferFull))
		{
			memcpy(g_txBuffer, g_rxBuffer, ECHO_BUFFER_LENGTH);
			rxBufferEmpty = true;
			txBufferFull  = true;
		}
	}

}
/* LPUART user callback */
void LPUART_UserCallback(LPUART_Type *base, lpuart_edma_handle_t *handle, status_t status, void *userData)
{
    userData = userData;

    if (kStatus_LPUART_TxIdle == status)
    {
        txBufferFull = false;
        txOnGoing    = false;
    }

    if (kStatus_LPUART_RxIdle == status)
    {
        rxBufferEmpty = false;
        rxOnGoing     = false;
    }
}


uint32_t LPUART_DMA_Initialize(uint32_t instance, uartState_t *pState)
{
		
 	lpuart_config_t lpuartConfig;
	edma_config_t config;
    uint32_t status = (uint32_t)gUartSuccess_c;
	BOARD_InitPins();
	BOARD_BootClockRUN();
	CLOCK_SetLpuart0Clock(0x1U);

