p744581755/kw38_uart/framework/SerialManager/source/UART_Serial_Adapter.c
	/* Initialize the LPUART. */
	/*
	 * lpuartConfig.baudRate_Bps = 115200U;
	 * lpuartConfig.parityMode = kLPUART_ParityDisabled;
	 * lpuartConfig.stopBitCount = kLPUART_OneStopBit;
	 * lpuartConfig.txFifoWatermark = 0;
	 * lpuartConfig.rxFifoWatermark = 0;
	 * lpuartConfig.enableTx = false;
	 * lpuartConfig.enableRx = false;
	 */
	LPUART_GetDefaultConfig(&lpuartConfig);
	lpuartConfig.baudRate_Bps = BOARD_DEBUG_UART_BAUDRATE;
	lpuartConfig.enableTx	  = true;
	lpuartConfig.enableRx	  = true;

	LPUART_Init(DEMO_LPUART, &lpuartConfig, DEMO_LPUART_CLK_FREQ);

#if defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT
	/* Init DMAMUX */
	DMAMUX_Init(EXAMPLE_LPUART_DMAMUX_BASEADDR);
	/* Set channel for LPUART */
	DMAMUX_SetSource(EXAMPLE_LPUART_DMAMUX_BASEADDR, LPUART_TX_DMA_CHANNEL, LPUART_TX_DMA_REQUEST);
	DMAMUX_SetSource(EXAMPLE_LPUART_DMAMUX_BASEADDR, LPUART_RX_DMA_CHANNEL, LPUART_RX_DMA_REQUEST);
	DMAMUX_EnableChannel(EXAMPLE_LPUART_DMAMUX_BASEADDR, LPUART_TX_DMA_CHANNEL);
	DMAMUX_EnableChannel(EXAMPLE_LPUART_DMAMUX_BASEADDR, LPUART_RX_DMA_CHANNEL);
#endif
	/* Init the EDMA module */
	EDMA_GetDefaultConfig(&config);
	EDMA_Init(EXAMPLE_LPUART_DMA_BASEADDR, &config);
	EDMA_CreateHandle(&g_lpuartTxEdmaHandle, EXAMPLE_LPUART_DMA_BASEADDR, LPUART_TX_DMA_CHANNEL);
	EDMA_CreateHandle(&g_lpuartRxEdmaHandle, EXAMPLE_LPUART_DMA_BASEADDR, LPUART_RX_DMA_CHANNEL);

	/* Create LPUART DMA handle. */
	LPUART_TransferCreateHandleEDMA(DEMO_LPUART, &g_lpuartEdmaHandle, LPUART_UserCallback, NULL, &g_lpuartTxEdmaHandle,
									&g_lpuartRxEdmaHandle);
	return status;
}

uint32_t LPUART_Initialize(uint32_t instance, uartState_t *pState)
{
    static bool initialized = FALSE;
    uint32_t status = (uint32_t)gUartSuccess_c;

#if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0))
    LPUART_Type * base;
    lpuart_config_t config;
    IRQn_Type irqs[] = LPUART_RX_TX_IRQS;

    if( (instance >= (uint32_t)FSL_FEATURE_SOC_LPUART_COUNT) || (NULL == pState) )
    {
        status = (uint32_t)gUartInvalidParameter_c;
    }
   else
   {
       base = mLpuartBase[instance];
       pLpuartStates[instance] = pState;
       /* Check if LPUART is already initialized */
       if( !initialized )
       {
           pState->rxCbParam = 0;
           pState->txCbParam = 0;
           pState->pRxData = NULL;
           pState->pTxData = NULL;
           pState->rxSize = 0;
           pState->txSize = 0;
           initialized = TRUE;
       }
       BOARD_InitLPUART();
       LPUART_GetDefaultConfig(&config);
       config.enableRx = TRUE;
       config.enableTx = TRUE;
       (void)LPUART_Init(base, &config, BOARD_GetLpuartClock(instance));

       LPUART_EnableInterrupts(base, (uint32_t)kLPUART_RxDataRegFullInterruptEnable);

       //OSA_InstallIntHandler(irqs[instance], LPUART_ISR);
#if defined(FSL_FEATURE_SOC_INTMUX_COUNT) && FSL_FEATURE_SOC_INTMUX_COUNT
       if( irqs[instance] < FSL_FEATURE_INTMUX_IRQ_START_INDEX )
#endif
       {
           NVIC_SetPriority(irqs[instance], (uint32_t)gUartIsrPrio_c >> (8 - __NVIC_PRIO_BITS));
           NVIC_EnableIRQ(irqs[instance]);
       }

       /* Need to wait for roughly 80us so first bad detected byte is received  before clearing the
              RX buffer, a for loop of 10000 @48Mhz is roughly 100us  */
#if defined(gSerialCyclesToWaitAfterInitialize) && ( gSerialCyclesToWaitAfterInitialize != 0)
       for (int i=gSerialCyclesToWaitAfterInitialize; i>0; i--) {}
       LPUART_ClearRxByte(instance);
#endif

       NVIC_ClearPendingIRQ(irqs[instance]);
   }
#endif
    return status;
}


/************************************************************************************/
uint32_t LPUART_SetBaudrate(uint32_t instance, uint32_t baudrate)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0))
    if( instance >= (uint32_t)FSL_FEATURE_SOC_LPUART_COUNT )
    {
        status = (uint32_t)gUartInvalidParameter_c;
    }
    else
    {
        status = (uint32_t)LPUART_SetBaudRate(mLpuartBase[instance], baudrate, BOARD_GetLpuartClock(instance));
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t LPUART_SendData(uint32_t instance, uint8_t* pData, uint32_t size)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0))
    LPUART_Type * base;

    if( (instance >= (uint32_t)FSL_FEATURE_SOC_LPUART_COUNT) || (0u == size) || (NULL == pData) )
    {
        status = (uint32_t)gUartInvalidParameter_c;
    }
    else
    {
        base = mLpuartBase[instance];

        OSA_InterruptDisable();
        if( (bool)pLpuartStates[instance]->txSize )
        {
            OSA_InterruptEnable();
            status = (uint32_t)gUartBusy_c;
        }
        else
        {
            while( !(bool)((uint32_t)kLPUART_TxDataRegEmptyFlag & LPUART_GetStatusFlags(base)) ) {}

            LPUART_WriteByte(base, *pData);
            pLpuartStates[instance]->pTxData = pData+1;
            pLpuartStates[instance]->txSize = size-1u;

            (void)LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_TxDataRegEmptyFlag);
            LPUART_EnableInterrupts(base, (uint32_t)kLPUART_TxDataRegEmptyInterruptEnable);

            OSA_InterruptEnable();
        }
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t LPUART_ReceiveData(uint32_t instance, uint8_t* pData, uint32_t size)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0))
    if( (instance >= (uint32_t)FSL_FEATURE_SOC_LPUART_COUNT)  || (0u == size) || (NULL == pData) )
    {
        status = (uint32_t)gUartInvalidParameter_c;
    }
    else
    {
        OSA_InterruptDisable();
        if( (bool)pLpuartStates[instance]->rxSize )
        {
            status = (uint32_t)gUartBusy_c;
        }
        else
        {
            pLpuartStates[instance]->rxSize = size;
            pLpuartStates[instance]->pRxData = pData;
        }
        OSA_InterruptEnable();
    }
#endif
    return status;
}

