p744581755/kw38_uart/framework/SerialManager/source/UART_Serial_Adapter.c
        USART_GetDefaultConfig(&config);
        config.enableRx = 1;
        config.enableTx = 1;
        USART_Init(base, &config, BOARD_GetUsartClock(instance));
        USART_EnableInterrupts(base, kUSART_RxLevelInterruptEnable);
        OSA_InstallIntHandler(mUsartIrqs[instance], USART_ISR);
        NVIC_SetPriority(mUsartIrqs[instance], gUartIsrPrio_c >> (8 - __NVIC_PRIO_BITS));
        NVIC_EnableIRQ(mUsartIrqs[instance]);
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_SetBaudrate(uint32_t instance, uint32_t baudrate)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    if (instance >= FSL_FEATURE_SOC_USART_COUNT)
    {
        status = gUartInvalidParameter_c;
    }
    else
    {
        status = USART_SetBaudRate(mUsartBase[instance], baudrate, BOARD_GetUsartClock(instance));
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_SendData(uint32_t instance, uint8_t *pData, uint32_t size)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    USART_Type *base;

    if (instance >= FSL_FEATURE_SOC_USART_COUNT || !size || !pData)
    {
        status = gUartInvalidParameter_c;
    }
    else
    {
        base = mUsartBase[instance];

        OSA_InterruptDisable();
        if (pUsartStates[instance]->txSize)
        {
            OSA_InterruptEnable();
            status = gUartBusy_c;
        }
        else
        {
            while (!(kUSART_TxFifoEmptyFlag & USART_GetStatusFlags(base)))
            {
            }

            pUsartStates[instance]->txSize = size - 1;
            pUsartStates[instance]->pTxData = pData + 1;
            USART_WriteByte(base, *pData);
            OSA_InterruptEnable();

            USART_ClearStatusFlags(base, kUSART_TxFifoEmptyFlag);
            USART_EnableInterrupts(base, kUSART_TxLevelInterruptEnable);
        }
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_ReceiveData(uint32_t instance, uint8_t *pData, uint32_t size)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    if (instance >= FSL_FEATURE_SOC_USART_COUNT || !size || !pData)
    {
        status = gUartInvalidParameter_c;
    }
    else
    {
        OSA_InterruptDisable();
        if (pUsartStates[instance]->rxSize)
        {
            status = gUartBusy_c;
        }
        else
        {
            pUsartStates[instance]->rxSize = size;
            pUsartStates[instance]->pRxData = pData;
        }
        OSA_InterruptEnable();
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_InstallRxCalback(uint32_t instance, uartCallback_t cb, uint32_t cbParam)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    if (instance >= FSL_FEATURE_SOC_USART_COUNT)
    {
        status = gUartInvalidParameter_c;
    }
    else
    {
        pUsartStates[instance]->rxCb = cb;
        pUsartStates[instance]->rxCbParam = cbParam;
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_InstallTxCalback(uint32_t instance, uartCallback_t cb, uint32_t cbParam)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    if (instance >= FSL_FEATURE_SOC_USART_COUNT)
    {
        status = gUartInvalidParameter_c;
    }
    else
    {
        pUsartStates[instance]->txCb = cb;
        pUsartStates[instance]->txCbParam = cbParam;
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_IsTxActive(uint32_t instance)
{
    uint32_t status = 0;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    if (instance < FSL_FEATURE_SOC_USART_COUNT)
    {
        if (pUsartStates[instance]->txSize)
        {
            status = 1;
        }
        else
        {
            status = !(USART_GetStatusFlags(mUsartBase[instance]) & kUSART_TxFifoEmptyFlag);
        }
    }
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_EnableLowPowerWakeup(uint32_t instance)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    // TODO
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_DisableLowPowerWakeup(uint32_t instance)
{
    uint32_t status = (uint32_t)gUartSuccess_c;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    // TODO
#endif
    return status;
}

/************************************************************************************/
uint32_t USART_IsWakeupSource(uint32_t instance)
{
    uint32_t status = 0;
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
    if( instance < FSL_FEATURE_SOC_USART_COUNT )
    {
        status = ((mUsartBase[instance]->STAT & USART_STAT_START_MASK) >> USART_STAT_START_SHIFT);
    }
#endif
    return status;
}

/*! *********************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
********************************************************************************* */
#if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0))
static void LPUART_Common_ISR(uint32_t instance)
{
    uint32_t interrupts;
    LPUART_Type * base;
    uartState_t * pState;
    bool frameError = false;

    base = mLpuartBase[instance];
    pState = pLpuartStates[instance];
    interrupts = LPUART_GetEnabledInterrupts(base);

    uint32_t status = LPUART_GetStatusFlags(base);

//    SERIAL_DBG_LOG("[%d] int=%x sts=%x", instance , interrupts, status);

    /*check noise error*/
    if(0u != ((uint32_t)kLPUART_NoiseErrorFlag & status))
    {
        (void)LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_NoiseErrorFlag);
        frameError = true;
    }

    /*check framing error*/
    if(0u != ((uint32_t)kLPUART_FramingErrorFlag & status))
    {
        (void)LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_FramingErrorFlag);
        frameError = true;
    }

