p744581755/kw38_uart/framework/SerialManager/source/UART_Serial_Adapter.c
    /*check parity error*/
    if(0u != ((uint32_t)kLPUART_ParityErrorFlag & status))
    {
        (void)LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_ParityErrorFlag);
        frameError = true;
    }

    /* Check if data was received */
    if( (bool)((uint32_t)(kLPUART_RxDataRegFullFlag) & status) )
    {
        uint8_t data = LPUART_ReadByte(base);

        if(false == frameError)
        {
            SERIAL_DBG_LOG("[%d] %x data=%x size=%d", instance , data, pState->rxSize);

            if( (bool)pState->rxSize )
            {
                pState->rxSize--;
            }
            if( pState->pRxData != NULL )
            {
                *(pState->pRxData) = data;
                pState->pRxData++;
            }

            if( (0u == pState->rxSize) && (NULL != pState->rxCb) )
            {
                pState->rxCb(pState);
            }

            //SERIAL_DBG_LOG("sts=%x", status);
        }
    }

    /* Check if data Tx has end */
    if( (bool)((uint32_t)kLPUART_TxDataRegEmptyFlag & status) &&
       (bool)((uint32_t)kLPUART_TxDataRegEmptyInterruptEnable & interrupts) )
    {
        if( (bool)pState->txSize )
        {
            pState->txSize--;

            LPUART_WriteByte(base, *(pState->pTxData++));
        }
        else
        {
            LPUART_DisableInterrupts(base, (uint32_t)kLPUART_TxDataRegEmptyInterruptEnable);

            if( NULL != pState->txCb )
            {
                pState->txCb(pState);
            }
        }
    }

    if( (bool)((uint32_t)kLPUART_RxOverrunFlag & status) )
    {
        (void)LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_RxOverrunFlag);
    }
    if( (bool)((uint32_t)kLPUART_RxActiveEdgeFlag & status) )
    {
        (void)LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_RxActiveEdgeFlag);
    }
}

#if FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1
void LPUART0_LPUART1_IRQHandler(void)
{
    const clock_ip_name_t lpuartClock[] = LPUART_CLOCKS;
    const LPUART_Type* lpuartBase[] = LPUART_BASE_PTRS;

    for (uint32_t i = 0; i < (sizeof(lpuartClock) / sizeof(clock_ip_name_t)); i++)
    {
        if (CLOCK_isEnabledClock(lpuartClock[i]))
        {
            if ((bool)(LPUART_STAT_OR_MASK & lpuartBase[i]->STAT) ||
                ((bool)(LPUART_STAT_RDRF_MASK & lpuartBase[i]->STAT) && (bool)(LPUART_CTRL_RIE_MASK & lpuartBase[i]->CTRL)) ||
                ((bool)(lpuartBase[i]->STAT & LPUART_STAT_TDRE_MASK) && (bool)(lpuartBase[i]->CTRL & LPUART_CTRL_TIE_MASK)))
            {
                 LPUART_Common_ISR(i);
            }
        }
    }
}
#else

#if defined(LPUART0)
void LPUART0_IRQHandler(void)
{
    LPUART_Common_ISR(0);
}
#endif

#if defined(LPUART1)
void LPUART1_IRQHandler(void)
{
    LPUART_Common_ISR(1);
}
#endif

#endif /* #if FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1 */

#if defined(LPUART2)
void LPUART2_IRQHandler(void)
{
    LPUART_Common_ISR(2);
}
#endif

#if defined(LPUART3)
void LPUART3_IRQHandler(void)
{
    LPUART_Common_ISR(3);
}
#endif

#if defined(LPUART4)
void LPUART4_IRQHandler(void)
{
    LPUART_Common_ISR(4);
}
#endif

#if defined(LPUART5)
void LPUART5_IRQHandler(void)
{
    LPUART_Common_ISR(5);
}
#endif
#endif /* #if (defined(FSL_FEATURE_SOC_LPUART_COUNT)&&(FSL_FEATURE_SOC_LPUART_COUNT > 0)) */

/************************************************************************************/
#if (defined(FSL_FEATURE_SOC_UART_COUNT)&&(FSL_FEATURE_SOC_UART_COUNT > 0))
static void UART_Common_ISR(uint32_t instance)
{
    UART_Type * base;
    uartState_t * pState;

    base = mUartBase[instance];
    pState = pUartStates[instance];
    /* Check if data was received */
    if( (kUART_RxDataRegFullFlag) & UART_GetStatusFlags(base) )
    {
        uint8_t data = UART_ReadByte(base);
        UART_ClearStatusFlags(base, kUART_RxDataRegFullFlag);

        if( pState->rxSize )
        {
            pState->rxSize--;
        }

        if( pState->pRxData )
        {
            *(pState->pRxData) = data;
            pState->pRxData++;
        }

        if( (0 == pState->rxSize) && (NULL != pState->rxCb) )
        {
            pState->rxCb(pState);
        }
    }
    /* Check if data Tx has end */
    if( (kUART_TxDataRegEmptyFlag) & UART_GetStatusFlags(base) &&
       (kUART_TxDataRegEmptyInterruptEnable) & UART_GetEnabledInterrupts(base) )
    {
        if( pState->txSize )
        {
            pState->txSize--;

            UART_WriteByte(base, *(pState->pTxData++));
        }
        else if( 0 == pState->txSize )
        {
            UART_DisableInterrupts(base, kUART_TxDataRegEmptyInterruptEnable);

            if( NULL != pState->txCb )
            {
                pState->txCb(pState);
            }
        }
    }

    if( kUART_RxOverrunFlag & UART_GetStatusFlags(base) )
    {
        UART_ClearStatusFlags(base, kUART_RxOverrunFlag);
    }
}

#if defined(UART0)
void UART0_RX_TX_IRQHandler(void)
{
    UART_Common_ISR(0);
}
#endif

#if defined(UART1)
void UART1_RX_TX_IRQHandler(void)
{
    UART_Common_ISR(1);
}
#endif

#if defined(UART2)
void UART2_RX_TX_IRQHandler(void)
{
    UART_Common_ISR(2);
}
#endif

#if defined(UART3)
void UART3_RX_TX_IRQHandler(void)
{
    UART_Common_ISR(3);
}
#endif

#if defined(UART4)
void UART4_RX_TX_IRQHandler(void)
{
    UART_Common_ISR(4);
}
#endif

#if defined(UART5)
void UART5_RX_TX_IRQHandler(void)
{
    UART_Common_ISR(5);
}
#endif
#endif /* #if (defined(FSL_FEATURE_SOC_UART_COUNT)&&(FSL_FEATURE_SOC_UART_COUNT > 0)) */

/************************************************************************************/
#if (defined(FSL_FEATURE_SOC_LPSCI_COUNT)&&(FSL_FEATURE_SOC_LPSCI_COUNT > 0))
static void LPSCI_Common_ISR(uint32_t instance)
{
    UART0_Type * base;
    uartState_t * pState;

    base = mLpsciBase[instance];
    pState = pLpsciStates[instance];
    /* Check if data was received */
    if( (kLPSCI_RxDataRegFullFlag) & LPSCI_GetStatusFlags(base) )
    {
        uint8_t data = LPSCI_ReadByte(base);
        LPSCI_ClearStatusFlags(base, kLPSCI_RxDataRegFullFlag);

        if( pState->rxSize )
        {
            pState->rxSize--;
        }

