p744581755/kw38_uart/framework/SerialManager/source/UART_Serial_Adapter.c
        if( pState->pRxData )
        {
            *(pState->pRxData) = data;
            pState->pRxData++;
        }

        if( (0 == pState->rxSize) && (NULL != pState->rxCb) )
        {
            pState->rxCb(pState);
        }
    }
    /* Check if data Tx has end */
    if( (kLPSCI_TxDataRegEmptyFlag) & LPSCI_GetStatusFlags(base) &&
       (kLPSCI_TxDataRegEmptyInterruptEnable) & LPSCI_GetEnabledInterrupts(base) )
    {
        if( pState->txSize )
        {
            pState->txSize--;

            LPSCI_WriteByte(base, *(pState->pTxData++));
        }
        else if( 0 == pState->txSize )
        {
            LPSCI_DisableInterrupts(base, kLPSCI_TxDataRegEmptyInterruptEnable);

            if( NULL != pState->txCb )
            {
                pState->txCb(pState);
            }
        }
    }

    if( kLPSCI_RxOverrunFlag & LPSCI_GetStatusFlags(base) )
    {
        LPSCI_ClearStatusFlags(base, kLPSCI_RxOverrunFlag);
    }
}

void UART0_IRQHandler(void)
{
    LPSCI_Common_ISR(0);
}
#endif

/************************************************************************************/
#if (defined(FSL_FEATURE_SOC_USART_COUNT)&&(FSL_FEATURE_SOC_USART_COUNT > 0))
static void USART_ISR(void)
{
    uint32_t irq = __get_IPSR() - 16;
    uint32_t instance;
    USART_Type *base;
    uartState_t *pState;

    /* Get instance */
    for (instance = 0; instance < FSL_FEATURE_SOC_USART_COUNT; instance++)
    {
        if (irq == mUsartIrqs[instance])
        {
            base = mUsartBase[instance];
            pState = pUsartStates[instance];

            /* Check if data was received */
            if ((kUSART_RxFifoNotEmptyFlag)& USART_GetStatusFlags(base))
            {
                uint8_t data = USART_ReadByte(base);

                if (pState->rxSize)
                {
                    pState->rxSize--;
                }

                if (pState->pRxData)
                {
                    *(pState->pRxData) = data;
                    pState->pRxData++;
                }

                if ((0 == pState->rxSize) && (NULL != pState->rxCb))
                {
                    pState->rxCb(pState);
                }
            }
            /* Check if data Tx has end */
            if ((kUSART_TxFifoEmptyFlag)&USART_GetStatusFlags(base) &&
                (kUSART_TxLevelInterruptEnable) & USART_GetEnabledInterrupts(base))
            {
                if (pState->txSize)
                {
                    pState->txSize--;

                    USART_WriteByte(base, *(pState->pTxData++));
                }
                else if (0 == pState->txSize)
                {
                    USART_DisableInterrupts(base, kUSART_TxLevelInterruptEnable);

                    if (NULL != pState->txCb)
                    {
                        pState->txCb(pState);
                    }
                }
            }

            if (kUSART_RxError & USART_GetStatusFlags(base))
            {
                USART_ClearStatusFlags(base, kUSART_RxError);
            }
            break;
        }
    }
}
#endif
